In [1]:
#Terlebih dahulu mengimport modules

import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

In [2]:
#Mempersiapkan Data Frame tahap 1

n_rows = 6
n_cols = 2
cols = ['Omset', 'Operasional']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), #berisi bilangan integer acak
                  columns=cols)
df

   Omset  Operasional
0     10           15
1     16            3
2     17            9
3      7           10
4      6           18
5      4           19

In [3]:
#Mempersiapkan Data Frame tahap 2

df['Omset'] = df['Omset'] * 100_000
df['Operasional'] = df['Operasional'] * 10_000
df

     Omset  Operasional
0  1000000       150000
1  1600000        30000
2  1700000        90000
3   700000       100000
4   600000       180000
5   400000       190000

In [4]:
#Mempersiapkan Data Frame tahap 3

df.index = pd.util.testing.makeDateIndex(n_rows, freq='D')
df = df.reset_index() #Berfungsi untuk menjadikan index saat ini menjadi sebuah kolom biasa dengan nama index
df = df.rename(columns={'index':'Tanggal'})
df

C:\Users\asus\anaconda3\lib\site-packages\pandas\util\__init__.py:8: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

     Tanggal    Omset  Operasional
0 2000-01-01  1000000       150000
1 2000-01-02  1600000        30000
2 2000-01-03  1700000        90000
3 2000-01-04   700000       100000
4 2000-01-05   600000       180000
5 2000-01-06   400000       190000

In [5]:
#Melakukan formatting tampilan Data Frame

#Style format
formatku = {'Tanggal':'{:%d/%m/%y}',
            'Operasional':'Rp {:.2f}',
            'Omset': 'Rp {:.2f}'}

laporan = df.style.format (formatku)
laporan

In [6]:
type(laporan) #Untuk mengetahui tipe data

pandas.io.formats.style.Styler

In [7]:
laporan.hide_index() #Menyembunyikan index

In [8]:
laporan.set_caption('Data Omset dan Operasional')

In [9]:
laporan.highlight_min('Omset', color='pink')            #Membuat warna pada kolom omset yang bernilai kecil
laporan.highlight_max('Omset', color='lightgreen')      #Membuat warna pada kolom omset yang bernilai besar

laporan.highlight_min('Operasional', color='lightblue') #Membuat warna pada kolom operasional yang bernilai kecil
laporan.highlight_min('Operasional', color='grey')      #Membuat warna pada kolom operasional yang bernilai besar